In [39]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

In [40]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ······

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: root@bank'

### Lesson 2 key concepts

> :clock10: 20 min

- What are views and their importance
- Working with views in SQL

  - Create a view


<summary>Code Sample: Views</summary>


<summary> Description: views and their importance </summary>

- Views are like virtual tables in the database that can be used for querying just like a regular table but they do not store any information permanently in them, like a table does; ie. a table occupies actual space in the database but views don't.
- Views can be built with queries on a single or multiple tables.
- Reasons why views are a very useful tool:

      - *Security*: Different users can be given access to different sets of views and not the complete database for eg. different departments would need different access levels based on the sensitivity of the information (hospital database where information about patients health is not available to administration or finance)
      - *Query simplicity*: It can help write neater and simplified query by not using many levels of nesting.



In the next query, we are creating a view to **find the current customers that might be risky in the future**. For this we found the average balance for the current customers in category `C` and checked which are the customers that have balances more than the average balance for that status category:

In [41]:
%%sql
drop view if exists running_contract_ok_balances;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.

[]

In [42]:
%%sql
select *, amount-payments as Balance
from bank.loan
where status = 'C'
order by Balance
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(0, 0, 987398, 0, 60, 0.0, 'C', 0.0),
 (6234, 6061, 980528, 5148, 12, 429.0, 'C', 4719.0),
 (6688, 8268, 970926, 8616, 24, 359.0, 'C', 8257.0),
 (6312, 6453, 980517, 10944, 36, 304.0, 'C', 10640.0),
 (6539, 7559, 980711, 12792, 12, 1066.0, 'C', 11726.0),
 (6852, 9140, 981110, 16032, 48, 334.0, 'C', 15698.0),
 (5463, 2413, 981006, 17952, 12, 1496.0, 'C', 16456.0),
 (7230, 10954, 970402, 18720, 60, 312.0, 'C', 18408.0),
 (7034, 10001, 960711, 19044, 36, 529.0, 'C', 18515.0),
 (5429, 2268, 960718, 20196, 36, 561.0, 'C', 19635.0)]

In [43]:
%%sql
create view running_contract_ok_balances as
with cte_running_contract_OK_balances  as (
  select *, amount-payments as Balance
  from bank.loan
  where status = 'C'
  order by Balance
)
select * from cte_running_contract_OK_balances
where Balance > (
  select avg(Balance)
  from cte_running_contract_OK_balances
)
order by Balance desc
limit 20;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.

[]

In [44]:
%%sql
select * from running_contract_ok_balances
limit 3;

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[(6534, 7542, 971019, 590820, 60, 9847.0, 'C', 580973.0),
 (6791, 8926, 980123, 566640, 60, 9444.0, 'C', 557196.0),
 (5132, 817, 950217, 538500, 60, 8975.0, 'C', 529525.0)]

# 3.06 Activity 2 (in rooms)

In order to spot possible fraud, we want to create a view **last_week_withdrawals** with total withdrawals by client in the last week.

In [38]:
%%sql
drop view if exists last_week_withdrawals;

create view last_week_withdrawals as
with transactions as (
  select *, (select max(date) from bank.trans) as max_date 
  from bank.trans
)

select client_id, round(sum(amount)) total_withdrawal
from bank.disp
left join transactions
using (account_id)
where date(date) > date_sub(max_date, interval 7 day)
group by client_id;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.
0 rows affected.

[]

In [40]:
%%sql
select * from last_week_withdrawals
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(3011, 16532.0),
 (3295, 4491.0),
 (3296, 1124.0),
 (4304, 2218.0),
 (2867, 1319.0)]